package sasa;

public class P1084_두수사이의수2 {

	public static void main(String[] args) {
		// 1084: 두 수 사이의 수(여러 경우)
//		오름차순으로 정렬된 수열에서, 입력받은 두 수 사이(두 수 포함)에 있는 숫자의 갯수를 구하여라. 
//		단 수열에는 동일한 수가 있을수 있으며, 두 수는 k번 입력된다. 
//		첫 줄에 배열의 길이 n (2 ≤ n ≤ 500,000) 
//		두 번째 줄부터 n개의 수 (0 ≤ 수 ≤ 500,000) 
//		세 번째 줄에 두 수가 입력되는 횟수 k (1 ≤ k ≤ 10,000) 
//		네 번째 줄부터 k줄에 걸쳐 두 수 a, b (-1,000,000 ≤ a ≤ b ≤ 1,000,000) 
//		입력예시
//		5
//		1 2 3 4 5
//		3
//		1 2
//		2 4
//		5 6
//		
//		k줄에 걸쳐 입력받은 두 수 사이(두 수 포함)에 있는 숫자의 갯수 
//		출력예시
//		2
//		3
//		1
		
		
		
	} // end main

} // end class